adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf9120_mlm1_modem</name>
  <series>nrf91</series>
  <version>1</version>
  <description>Alta reference description for radio MCU with ARM 32-bit Cortex-M4 Microcontroller </description>
  <licenseText>
            Copyright (c) 2016, Nordic Semiconductor ASA\n
            All rights reserved.\n
            \n
            Redistribution and use in source and binary forms, with or without\n
            modification, are permitted provided that the following conditions are met:\n
            \n
            * Redistributions of source code must retain the above copyright notice, this\n
              list of conditions and the following disclaimer.\n
            \n
            * Redistributions in binary form must reproduce the above copyright notice,\n
              this list of conditions and the following disclaimer in the documentation\n
              and/or other materials provided with the distribution.\n
            \n
            * Neither the name of Nordic Semiconductor ASA nor the names of its\n
              contributors may be used to endorse or promote products derived from\n
              this software without specific prior written permission.\n
            \n
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"\n
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\n
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\n
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf9120_mlm1_modem</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <MaxInterrupts>240</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FF0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TESTSTATUS</name>
          <description>Code memory test status. Will be set during production test.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TESTSTATUS</name>
              <description>Code memory test status. Will be set during production test.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST0</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CP1</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST00</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x108</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CP2</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST1</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID1</name>
              <description>1st ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID2</name>
              <description>2nd ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>LOTID3</name>
              <description>3rd ascii byte of Lot ID character</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>LOTID4</name>
              <description>4th ascii byte of Lot ID character</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST2</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x110</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID5</name>
              <description>5th ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID6</name>
              <description>6th ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WAFER</name>
              <description>Wafer number, 1 byte integer</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>XCOORD</name>
              <description>Device X-coordinate, always &amp;gt;=0, offset so that the leftmost value on wafer is 0</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST3</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>YCOORD</name>
              <description>Device Y-coordinate, always &amp;gt;=0, offset so that the bottom value on wafer is 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DR1</name>
              <description>Data Retention (DR) flag</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DR2</name>
              <description>Data Retention (DR) flag</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DR3</name>
              <description>Data Retention (DR) flag</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST4</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x118</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR4</name>
              <description>Data Retention (DR) flag</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST5</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST5</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST6</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST6</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST7</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST7</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST8</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x128</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST8</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FWID</name>
                <description>Deprecated field -  Identification number for the FW that is pre-loaded into the chip</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00052832</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x41414142</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000040</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000200</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x0000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CHIPCONF02</name>
          <description>Miscellaneous analog configuration. Will be set during production test.</description>
          <addressOffset>0x248</addressOffset>
          <access>read-only</access>
          <resetValue>0xF0C6FFFF</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUPCNT</name>
              <description>Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>IFCREADDELAY</name>
              <description>number of cycles before Information Configuration Registers can be read</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WS</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access, D-Code has one more wait-state.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5WS</name>
                  <description>5 wait-state in total for I-Code (6 for D-Code)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6WS</name>
                  <description>6 wait-state in total for I-Code (7 for D-Code)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7WS</name>
                  <description>7 wait-state in total for I-Code (8 for D-Code)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8WS</name>
                  <description>8 wait-state in total for I-Code (9 for D-Code)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9WS</name>
                  <description>9 wait-state in total for I-Code (10 for D-Code)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10WS</name>
                  <description>10 wait-state in total for I-Code (11 for D-Code)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11WS</name>
                  <description>11 wait-state in total for I-Code (12 for D-Code)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12WS</name>
                  <description>12 wait-state in total for I-Code (13 for D-Code)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13WS</name>
                  <description>13 wait-state in total for I-Code (14 for D-Code)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14WS</name>
                  <description>14 wait-state in total for I-Code (15 for D-Code)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15WS</name>
                  <description>15 wait-state in total for I-Code (16 for D-Code)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPCALIB</name>
              <description>TEMP module calibration value (default value for TEMP-&amp;gt;CALIB)</description>
              <lsb>22</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
