adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>FLASHPWRUP0</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x280</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP0</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP1</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x284</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP1</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster: Data</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Data</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PRODTEST[%s]</name>
          <description>Description collection: Production test control n</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PRODTEST</name>
              <description>Production test control (majority vote done for each bit over all three fields to get the used value)</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Done</name>
                  <description>Production tests done</description>
                  <value>0xBB42319F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>Production tests not done, SoC is in Virgin mode (with any other value than 0xBB42319F)</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BPROTINIT</name>
          <description>BPROT initialization data</description>
          <addressOffset>0x80C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>BPROTINIT</name>
              <description>BPROT CONFIG0 initialization data, covering 32 lowest 4kbyte blocks of Flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLICID[%s]</name>
          <description>Description collection: Public ID n</description>
          <addressOffset>0x810</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PUBLICID</name>
              <description>Public ID (32 bits of a 128 bit field)</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x44</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROOTKEY0[%s]</name>
          <description>Description collection: Root public key 0, total length 2176 bits = 272 bytes (end address is 0x92F)</description>
          <addressOffset>0x820</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <dim>0x44</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROOTKEY1[%s]</name>
          <description>Description collection: Root public key 1, total length 2176 bits = 272 bytes (end address is 0xA3F)</description>
          <addressOffset>0x930</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <dim>0x44</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROOTKEY2[%s]</name>
          <description>Description collection: Root public key 2, total length 2176 bits = 272 bytes (end address is 0xB4F)</description>
          <addressOffset>0xA40</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <dim>0x44</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROOTKEY3[%s]</name>
          <description>Description collection: Root public key 3, total length 2176 bits = 272 bytes (end address is 0xC5F)</description>
          <addressOffset>0xB50</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IMEI[%s]</name>
          <description>Description collection: IMEI n</description>
          <addressOffset>0xC60</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IMEI</name>
              <description>IMEI in BCD decoded nibbles</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MAC0[%s]</name>
          <description>Description collection: MAC0 n</description>
          <addressOffset>0xC68</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAC0</name>
              <description>MAC0 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MAC1[%s]</name>
          <description>Description collection: MAC1 n</description>
          <addressOffset>0xC70</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAC1</name>
              <description>MAC1 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MAC2[%s]</name>
          <description>Description collection: MAC2 n</description>
          <addressOffset>0xC78</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAC2</name>
              <description>MAC2 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MAC3[%s]</name>
          <description>Description collection: MAC3 n</description>
          <addressOffset>0xC80</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MAC3</name>
              <description>MAC3 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DEVCONF[%s]</name>
          <description>Description collection: Device configuration n</description>
          <addressOffset>0xC90</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVCONF</name>
              <description>Device configuration data, contents defined in SW</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DOWNGRADEPREV</name>
          <description>Downgrade prevention control. Totally 128 bits within 256 bytes,
                located in groups of 8 bits per 128 bit word (distributed due to 
                Flash write count limit)</description>
          <addressOffset>0xD80</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DOWNGRADEPREV</name>
              <description>Downgrade prevention control bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYREVOCATION</name>
          <description>Key revocation control</description>
          <addressOffset>0xE80</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>KEY0</name>
              <description>Root key 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Key enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Key disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY1</name>
              <description>Root key 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Key enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Key disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY2</name>
              <description>Root key 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Key enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Key disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY3</name>
              <description>Root key 3 (this key shall always be enabled, regardless of the value)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Key enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Key disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LIFECYCLESTATE</name>
          <description>Lifecycle state [7:0]</description>
          <addressOffset>0xE90</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LIFECYCLESTATE</name>
              <description>Lifecycle state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VIR</name>
                  <description>Virgin chip (b'1111)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MF</name>
                  <description>Manufactured chip (b'1110)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Secure chip (b'110X)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD</name>
                  <description>R&amp;amp;D chip (b'1011)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFR</name>
                  <description>Field failure return chip (b'01XX)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled chip (Other bit combinations)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKRESETREQUEST</name>
              <description>Secure Control reset request mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reset request mask enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reset request mask disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGCNTRL0</name>
          <description>Debug control bits [7:0]</description>
          <addressOffset>0xEA0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>OTP_M4_DBGEN</name>
              <description>M4 invasive debug control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M4 DBGEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M4 DBGEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M4_NIDEN</name>
              <description>M4 non-invasive debug control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M4 NIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M4 NIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M4_SPIDEN</name>
              <description>M4 secure invasive debug control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure debug enabled (M4 DBGEN=1 while M4 is in secure mode)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure debug disabled (M4 DBGEN=0 while M4 is in secure mode)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M4_SPNIDEN</name>
              <description>M4 secure non-invasive debug control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure debug enabled (M4 NIDEN=1 while M4 is in secure mode)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure debug disabled (M4 NIDEN=0 while M4 is in secure mode)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M0_DBGEN</name>
              <description>M0 invasive debug control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M0 DBGEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M0 DBGEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M0_NIDEN</name>
              <description>M0 non-invasive debug control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M0 NIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M0 NIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_DSP_DBGEN</name>
              <description>DSP invasive debug control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (DSP DBGEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (DSP DBGEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_DSP_NIDEN</name>
              <description>DSP non-invasive debug control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (DSP NIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (DSP NIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
