adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>DEBUGCNTRL1</name>
          <description>Debug control bits [13:8]</description>
          <addressOffset>0xEB0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>OTP_CS_DBGEN</name>
              <description>Coresight invasive debug control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (Coresight DBGEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (Coresight DBGEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_CS_NIDEN</name>
              <description>Coresight non-invasive debug control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (Coresight NIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (Coresight NIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_CS_SPIDEN</name>
              <description>Coresight secure invasive debug control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure debug enabled (Coresight SPIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure debug disabled (Coresight SPIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_CS_SPNIDEN</name>
              <description>Coresight secure non-invasive debug control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure debug enabled (Coresight SPNIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure debug disabled (Coresight SPNIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M4F_DBGEN</name>
              <description>M4F invasive debug control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M4F DBGEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M4F DBGEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTP_M4F_NIDEN</name>
              <description>M4F non-invasive debug control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug enabled (M4F NIDEN=1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug disabled (M4F NIDEN=0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCKCODESTATE</name>
          <description>SIM unlock code state for each lock level</description>
          <addressOffset>0xEC0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NCKSTATE</name>
              <description>State of network unlock code</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSCKSTATE</name>
              <description>State of network subset unlock code</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPCKSTATE</name>
              <description>State of service provider unlock code</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCKSTATE</name>
              <description>State of corporate unlock code</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCKSTATE</name>
              <description>State of SIM/USIM unlock code</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTERCODESTATE</name>
              <description>State of master unlock code</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Unlock code activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Unlock code not activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMLOCKDISABLE</name>
          <description>SIM lock controls for each lock level. 
                Disabling removes lock permanently</description>
          <addressOffset>0xED0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NCKDISABLING</name>
              <description>Network lock control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDisabled</name>
                  <description>Lock not disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSCKDISABLING</name>
              <description>Network subset lock control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDisabled</name>
                  <description>Lock not disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPCKDISABLING</name>
              <description>Service provider lock control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDisabled</name>
                  <description>Lock not disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCKDISABLING</name>
              <description>Corporate lock control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDisabled</name>
                  <description>Lock not disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCKDISABLING</name>
              <description>SIM/USIM lock control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDisabled</name>
                  <description>Lock not disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SECMASTERKEY[%s]</name>
          <description>Description collection: Secure master key n</description>
          <addressOffset>0xFC0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SECMASTERKEY</name>
              <description>Unique secure master key, word n, readable only by HW</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
