adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR</name>
      <description>User Information Configuration Registers</description>
      <baseAddress>0x00FF8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>NCKLOCK[%s]</name>
          <description>Description collection: Encrypted unlock code data for network lock n</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NCKLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>NSCKLOCK[%s]</name>
          <description>Description collection: Encrypted unlock code data for network subset lock n</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NSCKLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPCKLOCK[%s]</name>
          <description>Description collection: Encrypted unlock code data for service provider lock n</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SPCKLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCKLOCK[%s]</name>
          <description>Description collection: Encrypted unlock code data for corporate lock n</description>
          <addressOffset>0x030</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CCKLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PCKLOCK[%s]</name>
          <description>Description collection: Encrypted unlock code data for SIM/USIM lock n</description>
          <addressOffset>0x040</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PCKLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MASTERLOCK[%s]</name>
          <description>Description collection: Space reservation for encrypted master unlock code data n</description>
          <addressOffset>0x050</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MASTERLOCK</name>
              <description>Encrypted unlock code data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PROVIS[%s]</name>
          <description>Description collection: Provisioning data n</description>
          <addressOffset>0x060</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PROVIS</name>
              <description>Customer provisioning data, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTIMEI[%s]</name>
          <description>Description collection: Customer IMEI n, used if FICR-&amp;gt;IMEI 
                is not programmed</description>
          <addressOffset>0x070</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CIMEI</name>
              <description>Customer IMEI in BCD decoded nibbles</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTMAC0[%s]</name>
          <description>Description collection: Customer MAC0 n, used if FICR-&amp;gt;MAC0 
                is not programmed</description>
          <addressOffset>0x080</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTMAC0</name>
              <description>Customer MAC0 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTMAC1[%s]</name>
          <description>Description collection: Customer MAC1 n, used if FICR-&amp;gt;MAC1 
                is not programmed</description>
          <addressOffset>0x088</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTMAC1</name>
              <description>Customer MAC1 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTMAC2[%s]</name>
          <description>Description collection: Customer MAC2 n, used if FICR-&amp;gt;MAC2 
                is not programmed</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTMAC2</name>
              <description>Customer MAC2 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTMAC3[%s]</name>
          <description>Description collection: Customer MAC3 n, used if FICR-&amp;gt;MAC3 
                  is not programmed</description>
          <addressOffset>0x098</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTMAC3</name>
              <description>Customer MAC3 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTDEVCONF[%s]</name>
          <description>Description collection: Customer device configuration n, may be used to further 
                  limit configuration done by FICR-&amp;gt;DEVCONF</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTDEVCONF</name>
              <description>Customer device configuration data word n,
                  contents defined in SW</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMLOCK</name>
          <description>SIM lock data. Content and length T.B.D.</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>RFTUNING</name>
          <description>RF tuning data. Content and length T.B.D.</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
