adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRACEANDDEBUG</name>
      <description>Trace And Debug</description>
      <baseAddress>0xE0080000</baseAddress>
      <headerStructName>TRACEANDDEBUGALTA</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TRACEANDDEBUGALTA</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>STARTCLOCKS</name>
          <description>Start all Trace and Debug clocks.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>STARTCLOCKS</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STARTCLOCKS</name>
                  <description>Start all Trace and Debug clocks.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPCLOCKS</name>
          <description>Stop all Trace and Debug clocks.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>STOPCLOCKS</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPCLOCKS</name>
                  <description>Stop all Trace and Debug clocks.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_3</name>
          <description>TaskZeroPenalty register for PCP 3</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Zero_Penalty</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_3</name>
          <description>TaskFullPenalty register for PCP 3</description>
          <addressOffset>0x064</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Full_Penalty</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_2</name>
          <description>TaskZeroPenalty register for PCP 2</description>
          <addressOffset>0x068</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Zero_Penalty</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_2</name>
          <description>TaskFullPenalty register for PCP 2</description>
          <addressOffset>0x06C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Full_Penalty</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_1</name>
          <description>TaskZeroPenalty register for PCP 1</description>
          <addressOffset>0x070</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Zero_Penalty</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_1</name>
          <description>TaskFullPenalty register for PCP 1</description>
          <addressOffset>0x074</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Full_Penalty</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_0</name>
          <description>TaskZeroPenalty register for PCP 0</description>
          <addressOffset>0x078</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Zero_Penalty</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_0</name>
          <description>TaskFullPenalty register for PCP 0</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set_Full_Penalty</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLEDEBUG</name>
          <description>Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLEDEBUG</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLEDEBUG</name>
                  <description>Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>TRACEANDDEBUGALTA_PSEL</headerStructName>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>TRACECLK</name>
            <description>Pin number configuration for TraceClk signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA0</name>
            <description>Pin number configuration for TraceData0 signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA1</name>
            <description>Pin number configuration for TraceData1 signal</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA2</name>
            <description>Pin number configuration for TraceData2 signal</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRACEDATA3</name>
            <description>Pin number configuration for TraceData3 signal</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TRACEPORTSPEED</name>
          <description>Trace port speed selection</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRACEPORTSPEED</name>
              <description>Speed of Trace Port clock. Note that the TRACECLK pin will output this clock divided by two.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32 MHz Trace Port clock (TRACECLK = 16 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16 MHz Trace Port clock (TRACECLK = 8 MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MHz</name>
                  <description>8 MHz Trace Port clock (TRACECLK = 4 MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MHz</name>
                  <description>4 MHz Trace Port clock (TRACECLK = 2 MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWOSEL</name>
          <description>Connect the SWO to the TPIU TRACEDATA[0]</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWOSEL</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACEDATA0SEL</name>
                  <description>Connect the TRACEDATA[0] to the TPIU TRACEDATA[0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOSEL</name>
                  <description>Connect the SWO to the TPIU TRACEDATA[0]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMTSEL</name>
          <description>Timing control values for TSMC RAMs</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RTSEL</name>
              <description>Read cycle timing selection</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>WTSEL</name>
              <description>Write cycle timing selection</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY_REG[%s]</name>
          <description>Description collection: Penalty register for PCP n</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Full</name>
                  <description>(Auto 0) Full penalty)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Semi1</name>
                  <description>(Auto 1) Semi (power on, clock off)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Semi0</name>
                  <description>(Auto 2) Semi (power on, clock core on, clock buffer off)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Zero</name>
                  <description>(Auto 3) Zero penalty</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
