adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>RESETREAS</name>
          <description>Reset reason</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESETPIN</name>
              <description>Reset from pin-reset detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOG</name>
              <description>Reset from global watchdog detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCOMP</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from ANADETECT signal from LPCOMP</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFC</name>
              <description>Reset due to wake up from System OFF mode by NFC field detect</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREQ</name>
              <description>Reset from AIRCR.SYSRESETREQ detected</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>Reset from CPU lock-up detected</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOG</name>
              <description>Reset from local watchdog detected</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDOG</name>
              <description>Reset from secure watchdog detected</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCTRL</name>
              <description>Reset from secure control detected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRST</name>
              <description>CPU reset from MCUMASTER detected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFORCEOFF</name>
              <description>Force off reset from MCUMASTER detected</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCNF</name>
          <description>Sleep configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEPMODE</name>
              <description>Sleep mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LIGHTSLEEP</name>
                  <description>Light sleep FF retention mode will be used if available. Otherwise FFs are kept powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Deep sleep (wake from reset) No FF retention (needs wake from reset).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPREGRET[%s]</name>
          <description>Description collection: General purpose retention register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPREGRET</name>
              <description>General purpose retention register</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DSP</name>
          <description>Control register for DSP</description>
          <headerStructName>DPOWER_DSP</headerStructName>
          <addressOffset>0x610</addressOffset>
          <register>
            <name>RESET</name>
            <description>Reset DSP subsystem</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>RESET</name>
                <description>RESET</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release CPU reset signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold CPU reset signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEOFF</name>
            <description>Force off power and clock in DSP subsystem</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>FORCEOFF</name>
                <description>RESET</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force off signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force off signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEON</name>
            <description>Force on power and clock in DSP subsystem</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEON</name>
                <description>Forces on power and clock in DSP subsystem</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force on signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force on signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HALT</name>
            <description>Halt DSP subsystem</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>HALT</name>
                <description>Halt DSP subsystem</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release halt signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold halt signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>LYNX</name>
          <description>Control register for Lynx RF subsystem</description>
          <headerStructName>DPOWER_LYNX</headerStructName>
          <addressOffset>0x620</addressOffset>
          <register>
            <name>RESET</name>
            <description>Reset Lynx RF subsystem</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>RESET</name>
                <description>CPU soft reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release CPU reset signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold CPU reset signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEOFF</name>
            <description>Force off power and clock in Lynx RF subsystem</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>FORCEOFF</name>
                <description>RESET</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force off signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force off signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEON</name>
            <description>Force on Lynx RF subsystem</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEON</name>
                <description>Forces an power and clock DSP subsystem</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Release</name>
                    <description>Release force on signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hold</name>
                    <description>Hold force on signal.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
