adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>RUNNING</name>
          <description>Status of running timer</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Current status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Timer is powered off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING</name>
                  <description>Timer is actively running.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPPED</name>
                  <description>Timer is stopped.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO0</name>
          <description>Capture/Compare register 0 - Low Word</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI0</name>
          <description>Capture/Compare register 0 - High Word</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO1</name>
          <description>Capture/Compare register 1 - Low Word</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI1</name>
          <description>Capture/Compare register 1 - High Word</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO2</name>
          <description>Capture/Compare register 2 - Low Word</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI2</name>
          <description>Capture/Compare register 2 - High Word</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO3</name>
          <description>Capture/Compare register 3 - Low Word</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI3</name>
          <description>Capture/Compare register 3 - High Word</description>
          <addressOffset>0x55C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO4</name>
          <description>Capture/Compare register 4 - Low Word</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI4</name>
          <description>Capture/Compare register 4 - High Word</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO5</name>
          <description>Capture/Compare register 5 - Low Word</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI5</name>
          <description>Capture/Compare register 5 - High Word</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO6</name>
          <description>Capture/Compare register 6 - Low Word</description>
          <addressOffset>0x570</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI6</name>
          <description>Capture/Compare register 6 - High Word</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLO7</name>
          <description>Capture/Compare register 7 - Low Word</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLO</name>
              <description>Capture/Compare value Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCHI7</name>
          <description>Capture/Compare register 7 - High Word</description>
          <addressOffset>0x57C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCHI</name>
              <description>Capture/Compare value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTLO</name>
          <description>Internal Counter Value - Low Word</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COUNTLO</name>
              <description>Internal Counter Value - Low Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTHI</name>
          <description>Internal Counter Value - High Word</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COUNTHI</name>
              <description>Internal Counter Value High Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
