adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>CLKRATE</name>
          <description>Divider value for setting the clock rate to the SIM card.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>CLOCKRATE</name>
              <description>Divider for setting the clock frequency to the SIM card clock (clock  = input clock / ClockRate</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUDRATE</name>
          <description>Divider value for setting the baud rate to the SIM card.</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000174</resetValue>
          <fields>
            <field>
              <name>BAUDRATE</name>
              <description>Divider for setting the baud rate to the SIM card.(Baud rate  = Sim card clock/BaudRate).</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHARACTERGUARDTIME</name>
          <description>Character Guard time</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000C</resetValue>
          <fields>
            <field>
              <name>CHARACTERGUARDTIME</name>
              <description>Guard time from leading edge of the character to the leading edge of the next character in ETU</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHARACTERWAITTIME</name>
          <description>Character Wait time</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>CHARACTERWAITTIME</name>
              <description>T=1 character Rx wait time in ETU</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCKWAITTIME</name>
          <description>Block Wait time</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002580</resetValue>
          <fields>
            <field>
              <name>BLOCKWAITTIME</name>
              <description>Block wait time in ETU, default 9600</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PROTOCOL</name>
          <description>Protocol selection</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol selection 0: T=0, 1: T=1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T0</name>
                  <description>T=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T1</name>
                  <description>T=1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWIMPEDANCE</name>
          <description>Low impedance driver use</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOWIMPEDANCE</name>
              <description>Low impedance driver use</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OpenDrain</name>
                  <description>open drain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowImpedance</name>
                  <description>use 		low impedance drivers</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T1PCBCONTROL</name>
          <description>T=1 Tx PCB bits 5:6</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOREDATABIT</name>
              <description>More data (chaining) bit, PCB[5]</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SENDSEQUENCENUMBER</name>
              <description>Send Sequence number, PCB[6]</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKCONTROL</name>
          <description>Clock Control</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable clock</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClockOff</name>
                  <description>Clock is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockOn</name>
                  <description>Clock is on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKSTOP</name>
              <description>Clock stop state</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Illegal</name>
                  <description>Not allowed</description>
                  <value>00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Clock stops low</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Clock stops high</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLTAGE</name>
          <description>Sim card operating voltage</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VOLTAGE</name>
              <description>Sim card operating voltage</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V</name>
                  <description>Card voltage off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1800mV</name>
                  <description>Card operating voltage 1.8V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3000mV</name>
                  <description>Card operating voltage 3V</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LRCENABLE</name>
          <description>LRC Calculation enable</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LRCENABLE</name>
              <description>LRC Calculation enable for T=1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>LRC calculation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>LRC 			calculation enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA</name>
          <description>NonDMA data to be sent to the SIM card</description>
          <addressOffset>0x52C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>NonDMA data to be sent to the SIM card</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCONFIG</name>
          <description>Uart configuration</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UARTCONFIG</name>
              <description>Uart configuration, for details see Uart spec</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITEMAXATT</name>
          <description>Number of write attempts before error interrupt</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>WRITEMAXATT</name>
              <description>Number of write attempts before error interrupt</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>READMAXATT</name>
          <description>Number of read attempts before error interrupt</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>READMAXATT</name>
              <description>Number of read attempts before error interrupt</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UartEnable</name>
          <description>UART Enable</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UartEnable</name>
              <description>UART master enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UartRxEnable</name>
          <description>UART Rx Enable</description>
          <addressOffset>0x578</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UartRxEnable</name>
              <description>UART Rx enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UartTxEnable</name>
          <description>UART Tx Enable</description>
          <addressOffset>0x57C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UartTxEnable</name>
              <description>UART Tx enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXADDR</name>
          <description>DMA access  buffer RAM start address</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXSTARTADDRESS</name>
              <description>DMA access  buffer RAM start address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBUFFERSIZE</name>
          <description>Byte count to receive in Dma Rx operation</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXBUFFERSIZE</name>
              <description>Byte count to receive in Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBYTECOUNT</name>
          <description>Byte count received in latest Dma Rx operation</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXBYTECOUNT</name>
              <description>Byte count received in latest Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXSELECTLIST</name>
          <description>Rx select address from list</description>
          <addressOffset>0x610</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXSELECTLIST</name>
              <description>Select address from list</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXADDR</name>
          <description>Start address for DMA access in buffer RAM</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXSTARTADDRESS</name>
              <description>Start address for DMA access in buffer RAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBUFFERSIZE</name>
          <description>Byte count to transmit in Dma Rx operation</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXBUFFERSIZE</name>
              <description>Byte count to transmit in Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBYTECOUNT</name>
          <description>Byte count transmitted in latest Dma Tx operation</description>
          <addressOffset>0x708</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXBYTECOUNT</name>
              <description>Byte count transmitted in latest Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXSELECTLIST</name>
          <description>Tx select address from list</description>
          <addressOffset>0x710</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXSELECTLIST</name>
              <description>Select address from list</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
