adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>POWER</name>
          <description>Peripheral power control</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral is powered off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral is powered on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOTE0">
      <name>GPIOTE1</name>
      <description>GPIO Tasks and Events 1</description>
      <baseAddress>0x40031000</baseAddress>
      <interrupt>
        <name>GPIOTE1</name>
        <value>49</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SECCONTROL</name>
      <description>Secure Control</description>
      <baseAddress>0x40032000</baseAddress>
      <headerStructName>SECURECONTROL</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SECURECONTROL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>OTPTOPADDR</name>
          <description>Top address of the OTP area. Address must be divisible by four</description>
          <addressOffset>0x400</addressOffset>
          <access>writeonce</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>OTPTOPADDR</name>
              <description>Top address of the OTP area.  This register type is WRITE ONCE.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREEXIT</name>
          <description>Writing to this register will enable secure exit.</description>
          <addressOffset>0x404</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECUREEXIT</name>
              <description>Writing to this register will enable secure exit.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECUREEXIT</name>
                  <description>Secure Exit disabled. Secure Exit enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SNOOPENABLE</name>
          <description>Enable SecureEntry snooping.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SNOOPENABLE</name>
              <description>Enable SecureEntry snooping.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure Entry sequence snooping disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure Entry sequence snooping enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECWRENABLERANGE</name>
          <description>FICR Wr enable range.</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SECWREABLERANGE</name>
              <description>FICR Wr enable range.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDMAPROMOTION</name>
          <description>AES DMA promoted as a secure device.</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AESDMAPROMOTION</name>
              <description>AES DMA promotion as a secure device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nonsecure</name>
                  <description>AES DMA is a nonsecure device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>AES DMA is a secure device.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADMAPROMOTION</name>
          <description>SHA DMA promoted as a secure device.</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHADMAPROMOTION</name>
              <description>SHA DMA promotion as a secure device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nonsecure</name>
                  <description>AES DMA is a nonsecure device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>AES DMA is a secure device.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREWATCHDOGPAUSE</name>
          <description>Secure watchdog pause control.</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECUREWDPAUSE</name>
              <description>Secure watchdog pause control.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Secure WD running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Paused</name>
                  <description>Secure WD paused.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
