adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Status on whether PIN26 has met criteria set in PIN_CNF26.SENSE register. Write '1' to clear.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Status on whether PIN27 has met criteria set in PIN_CNF27.SENSE register. Write '1' to clear.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Status on whether PIN28 has met criteria set in PIN_CNF28.SENSE register. Write '1' to clear.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Status on whether PIN29 has met criteria set in PIN_CNF29.SENSE register. Write '1' to clear.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN30</name>
              <description>Status on whether PIN30 has met criteria set in PIN_CNF30.SENSE register. Write '1' to clear.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Status on whether PIN31 has met criteria set in PIN_CNF31.SENSE register. Write '1' to clear.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DETECTMODE</name>
          <description>Select between default DETECT signal behaviour and LDETECT mode</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DETECTMODE</name>
              <description>Select between default DETECT signal behaviour and LDETECT mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>DETECT directly connected to PIN DETECT signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDETECT</name>
                  <description>Use the latched LDETECT behaviour</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>PIN[%s]</name>
          <description>Pin n direct access</description>
          <headerStructName>GPIO_PIN</headerStructName>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>OUT</name>
            <description>Description cluster: Pin n direct access output register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>OUT</name>
                <description>Direct access</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IN</name>
            <description>Description cluster: Pin n direct access input register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>IN</name>
                <description>Direct access</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN_CNF[%s]</name>
          <description>Description collection: Configuration of GPIO pins</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>DIR</name>
              <description>Pin direction. Same physical register as DIR register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Configure pin as an input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Configure pin as an output pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>Connect or disconnect input buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Connect</name>
                  <description>Connect input buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disconnect</name>
                  <description>Disconnect input buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL</name>
              <description>Pull configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No pull</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulldown</name>
                  <description>Pull down on pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pullup</name>
                  <description>Pull up on pin</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive configuration</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0S1</name>
                  <description>Standard '0', standard '1'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0S1</name>
                  <description>High drive '0', standard '1'</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0H1</name>
                  <description>Standard '0', high drive '1'</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0H1</name>
                  <description>High drive '0', high 'drive '1''</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0S1</name>
                  <description>Disconnect '0' standard '1' (normally used for wired-or connections)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0H1</name>
                  <description>Disconnect '0', high drive '1' (normally used for wired-or connections)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0D1</name>
                  <description>Standard '0'. disconnect '1' (normally used for wired-and connections)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0D1</name>
                  <description>High drive '0', disconnect '1' (normally used for wired-and connections)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE</name>
              <description>Pin sensing mechanism</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Sense for high level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Sense for low level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN</name>
              <description>Override of analog mux enable signals for pads with analog functionality</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Override of analog mux is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AE0</name>
                  <description>Enable analog signal 0 (analog test bus)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
