adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>L2CIPHER</name>
      <description>L2 Cipher Registers</description>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>L2CIPHER</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKZEROPENALTY_PCP_1</name>
          <description>TaskZeroPenalty register for PCP 1</description>
          <addressOffset>0x070</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET_ZERO_PENALTY</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_1</name>
          <description>TaskFullPenalty register for PCP 1</description>
          <addressOffset>0x074</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET_FULL_PENALTY</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_0</name>
          <description>TaskZeroPenalty register for PCP 0</description>
          <addressOffset>0x078</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ZERO_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET_ZERO_PENALTY</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_0</name>
          <description>TaskFullPenalty register for PCP 0</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FULL_PENALTY</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET_FULL_PENALTY</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY_REG[%s]</name>
          <description>Description collection: Penalty register for PCP n</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>Penalty</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Full</name>
                  <description>Auto 0) Full penalty)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Semi1</name>
                  <description>(Auto 1)  Semi (power on, clock off)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Semi0</name>
                  <description>(Auto 2) Semi (power on, clock core on, clock buffer off)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Zero</name>
                  <description>(Auto 3)  Zero penalty</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCE_OVERRIDE[%s]</name>
          <description>Description collection: Force override register for PCP n</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCK_SWITCH_REQUEST_A</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.switch_a = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.switch_a = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_SWITCH_REQUEST</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_BUFFER_REQUEST</name>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.buff = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.buff = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORE_CLOCK_REQUEST</name>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_FORCING</name>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE0</name>
                  <description>All clock forcing  disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE1</name>
                  <description>All clock forcing  enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWER_SWITCH_REQUEST</name>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>powerRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>powerRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORE_POWER_REQUEST</name>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>powerRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>powerRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>all forcing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>all forcing enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TURN_OFF_AUTO_CLOCKSOURCE_REQ</name>
          <description>Turn of the automatic clock request.</description>
          <addressOffset>0xC30</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCK_START_PCP_0</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PCP_0</name>
                  <description>normal clock start for PCP 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_PCP_0</name>
                  <description>turn off normal clock start for PCP 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_START_PCP_1</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PCP_1</name>
                  <description>normal clock start for PCP 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_PCP_1</name>
                  <description>turn off normal clock start for PCP 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
