adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCE_OVERRIDE[%s]</name>
          <description>Description collection: Force override register for PCP n</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ClockRequestSwitchA</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>clockRequest.switch_a = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>clockRequest.switch_a = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClockRequestSwitch</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>clockRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>clockRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClockRequestBuff</name>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>clockRequest.buff = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>clockRequest.buff = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClockRequestCore</name>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>clockRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>clockRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClockForcing</name>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>All clock forcing  disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>All clock forcing  enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PowerRequestSwitch</name>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>powerRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>powerRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PowerRequestCore</name>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>powerRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>powerRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ForceCtrl</name>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>all forcing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>all forcing enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TURN_OFF_AUTO_CLOCKSOURCE_REQ</name>
          <description>Turn of the automatic clock request.</description>
          <addressOffset>0xC30</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ClockStartPcp0</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal_on</name>
                  <description>normal clock start for PCP 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>normal_off</name>
                  <description>turn off normal clock start for PCP 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClockStartPcp1</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal_on</name>
                  <description>normal clock start for PCP 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>normal_off</name>
                  <description>turn off normal clock start for PCP 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
