adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ZUC</name>
      <description>ZUC LTE L2 security IP</description>
      <baseAddress>0x40044000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ZUC</name>
        <value>68</value>
      </interrupt>
      <groupName>ZUC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STARTGATHER</name>
          <description>Start input DMA</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTGATHER</name>
              <description>Start input DMA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOPGATHER</name>
          <description>Stop  input DMA</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOPGATHER</name>
              <description>Stop  input DMA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTSCATTER</name>
          <description>Start output DMA</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTSCATTER</name>
              <description>Start output DMA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOPSCATTER</name>
          <description>Stop  output DMA</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOPSCATTER</name>
              <description>Stop  output DMA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_INITIALIZEZUC</name>
          <description>New keys (and IV) ready to be used, reset keybytes, ivbytes</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_INITIALIZEZUC</name>
              <description>New keys (and IV) ready to be used, reset keybytes, ivbytes</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTOPERATION</name>
          <description>Start cipher / MAC calculation depending on MODE</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTOPERATION</name>
              <description>Start cipher / MAC calculation depending on MODE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_FINALIZEMAC</name>
          <description>Finalize MAC calculation</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_FINALIZEMAC</name>
              <description>Finalize MAC calculation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESET</name>
          <description>Stop all transfers and crypto operations (initialize)</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_RESET</name>
              <description>Stop all transfers and crypto operations (initialize)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_1</name>
          <description>TaskZeroPenalty register for PCP 1</description>
          <addressOffset>0x0070</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_1</name>
          <description>TaskFullPenalty register for PCP 1</description>
          <addressOffset>0x0074</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKZEROPENALTY_PCP_0</name>
          <description>TaskZeroPenalty register for PCP 0</description>
          <addressOffset>0x0078</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Set Zero Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKFULLPENALTY_PCP_0</name>
          <description>TaskFullPenalty register for PCP 0</description>
          <addressOffset>0x007C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty Level</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Set Full Penalty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_GATHERSTARTED</name>
          <description>Input DMA started</description>
          <addressOffset>0x0100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_GATHERSTARTED</name>
              <description>Input DMA started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_GATHERDONE</name>
          <description>Input DMA done</description>
          <addressOffset>0x0104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_GATHERDONE</name>
              <description>Input DMA done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SCATTERSTARTED</name>
          <description>Output DMA started</description>
          <addressOffset>0x0108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SCATTERSTARTED</name>
              <description>Output DMA started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SCATTERDONE</name>
          <description>Output DMA done</description>
          <addressOffset>0x010C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SCATTERDONE</name>
              <description>Output DMA done</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_IVREADY</name>
          <description>IV received (ivbytes == 16)</description>
          <addressOffset>0x0110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_IVREADY</name>
              <description>IV received (ivbytes == 16)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ZUCINITIALIZED</name>
          <description>New keys and IV taken into use</description>
          <addressOffset>0x0114</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ZUCINITIALIZED</name>
              <description>New keys and IV taken into use</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_MESSAGEREADY</name>
          <description>LENGTH == 0</description>
          <addressOffset>0x0118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_MESSAGEREADY</name>
              <description>LENGTH == 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_MACREADY</name>
          <description>MAC calculated</description>
          <addressOffset>0x011C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_MACREADY</name>
              <description>MAC calculated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RESETTED</name>
          <description>Resetted (all transfers and crypto operations stopped)</description>
          <addressOffset>0x0120</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RESETTED</name>
              <description>Resetted (all transfers and crypto operations stopped)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x0200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GATHERSTARTED_STARTSCATTER</name>
              <description>Shortcut between event GATHERSTARTED and task STARTSCATTER</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IVREADY_INITIALIZEZUC</name>
              <description>Shortcut between event IVREADY and task INITIALIZEZUC</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZUCINITIALIZED_STARTOPERATION</name>
              <description>Shortcut between event ZUCINITIALIZED and task STARTOPERATION</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MESSAGEREADY_FINALIZEMAC</name>
              <description>Shortcut between event MESSAGEREADY and task FINALIZEMAC</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZUCINITIALIZED_STARTGATHER</name>
              <description>Shortcut between event ZUCINITIALIZED and task STARTGATHER</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCATTERDONE_RESET</name>
              <description>Shortcut between event SCATTERDONE and task RESET</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACREADY_RESET</name>
              <description>Shortcut between event MACREADY and task RESET</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
