adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCE_OVERRIDE[%s]</name>
          <description>Description collection: Force override register for PCP n</description>
          <addressOffset>0x0C10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCK_SWITCH_REQUEST_A</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.switch_a = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.switch_a = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_SWITCH_REQUEST</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_BUFFER_REQUEST</name>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.buff = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.buff = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORE_CLOCK_REQUEST</name>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>clockRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>clockRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_FORCING</name>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE0</name>
                  <description>All clock forcing  disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE1</name>
                  <description>All clock forcing  enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWITCH_POWER_REQUEST</name>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>powerRequest.switch = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>powerRequest.switch = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORE_POWER_REQUEST</name>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ0</name>
                  <description>powerRequest.core = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ1</name>
                  <description>powerRequest.core = 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>all forcing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>all forcing enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TURN_OFF_AUTO_CLOCKSOURCE_REQ</name>
          <description>Turn of the automatic clock request.</description>
          <addressOffset>0x0C30</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLOCK_START_PCP_0</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_0</name>
                  <description>normal clock start for PCP 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_0</name>
                  <description>turn off normal clock start for PCP 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_START_PCP_1</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_1</name>
                  <description>normal clock start for PCP 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_1</name>
                  <description>turn off normal clock start for PCP 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
