adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
        <register>
          <name>TESTCONFIG_2</name>
          <description>Mode of operation of the counter. Flash macro 2.</description>
          <addressOffset>0x6A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Returns the state of the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Counter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Counter is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Defines the starting point of the counter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE</name>
                  <description>Counter starts on SE rising edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YE</name>
                  <description>Counter starts on YE rising edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINC</name>
              <description>Controls the address auto-increment or -decrement</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Increment</name>
                  <description>Address is auto-incrementing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decrement</name>
                  <description>Address is auto-decrementing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINCEN</name>
              <description>Disables the address auto-increment or -decrement</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Address auto-incrementing/decrementing is disabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Address auto-incrementing/decrementing is enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTTMVPPANAEN_2</name>
          <description>Controls analog signals for flash measurements. Flash macro 2.</description>
          <addressOffset>0x6A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMANAEN</name>
              <description>Analog enable for TM measurement. Needs to be set when measuring TM[3:0] on P0.05, P0.04, P0.01 and P0.00.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>All pads disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>All pads enabled</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VPPDIVEN</name>
              <description>Enable the VPPDIV pad. Needs to be set when measuring VPPDIV on GPIO26 (P0.20), and when applying high-voltage on VPP pad.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VPPDIV pad disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VPPDIV pad enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEONNVM</name>
          <description>Force on NVM. See also the internal section in the NVMC chapter.</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEONNVM</name>
              <description>Force on NVM controller. See also the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOn</name>
                  <description>Do not force on NVM controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOn</name>
                  <description>Force on NVM controller</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
