adamkondraciuk/nrfx/mdk/nrf9120_mlm1_modem.svd
          <register>
            <name>POWERCLR</name>
            <description>Description cluster: RAM  Bn power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S015POWER</name>
                <description>Keep RAM section S0-S15 of RAM Bn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER0</name>
                <description>Unused power set bit 0</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power set bit 1</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>UNUSED_POWER2</name>
                <description>Unused power set bit 2</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>UNUSED_POWER3</name>
                <description>Unused power set bit 3</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>UNUSED_POWER4</name>
                <description>Unused power set bit 4</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>UNUSED_POWER5</name>
                <description>Unused power set bit 5</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>UNUSED_POWER6</name>
                <description>Unused power set bit 6</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UNUSED_POWER7</name>
                <description>Unused power set bit 7</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>UNUSED_POWER8</name>
                <description>Unused power set bit 8</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>UNUSED_POWER9</name>
                <description>Unused power set bit 9</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>UNUSED_POWER10</name>
                <description>Unused power set bit 10</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>S015RETENTION</name>
                <description>Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION0</name>
                <description>Unused retention set bit 0</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention set bit 1</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION2</name>
                <description>Unused retention set bit 2</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION3</name>
                <description>Unused retention set bit 3</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION4</name>
                <description>Unused retention set bit 4</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION5</name>
                <description>Unused retention set bit 5</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION6</name>
                <description>Unused retention set bit 6</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION7</name>
                <description>Unused retention set bit 7</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION8</name>
                <description>Unused retention set bit 8</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION9</name>
                <description>Unused retention set bit 9</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION10</name>
                <description>Unused retention set bit 10</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>RAMC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAMC</headerStructName>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster: RAM Cn power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM Cn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on RAM sections S0 and S1 of RAM Cn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>Description cluster: RAM Cn power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM Cn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power set bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on sections S0 and S1 of RAM of RAM Cn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention set bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCLR</name>
            <description>Description cluster: RAM  Cn power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM Cn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power clear bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on RAM sections S0 and S1 of RAM Cn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention clear bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RAMD</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAMD</headerStructName>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>POWER</name>
            <description>RAM D{n} power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on RAM sections S0 and S1 of RAM D{n} when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>RAM D{n} power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power set bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on sections S0 and S1 of RAM of RAM D{n} when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention set bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCLR</name>
            <description>RAM  D{n} power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Keep RAM sections S0 and S1 of RAM D{n} on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power clear bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Keep retention on RAM sections S0 and S1 of RAM D{n} when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention clear bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SRAMTRIM</name>
          <description>Backdoor trim values for SRAM</description>
          <addressOffset>0xEE4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000048</resetValue>
          <fields>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RamSSNonRetTSel</name>
          <description>Timing control values for TSMC RAMs</description>
          <addressOffset>0xEE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RTSEL</name>
              <description>Read cycle timing selection</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>WTSEL</name>
              <description>Write cycle timing selection</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>